{
  "contactForm": {
    "labels": {
      "email": "Je email",
      "message": "Je bericht aan mij",
      "name": "Je naam",
      "optional": "(optioneel)"
    },
    "tip": "Geïnteresseerd, of heeft u tips/vragen voor mij?\n\nLaat het me weten!",
    "submit": {
      "messageError": "Vul a.u.b. een bericht in.",
      "nameAndMessageError": "Vul a.u.b. je naam en bericht in.",
      "nameError": "Vul a.u.b. je naam in.",
      "submissionError": "Oops, er is iets mis gegaan, neem contact op via de mail: victorhubbers@live.nl.",
      "submitButton": "Versturen",
      "thanks": "Bedankt!"
    }
  },
  "greeting": {
    "left": "Hallo, ik ben Victor, een",
    "right": "welkom op mijn portfolio.",
    "center": "Software Developer"
  },
  "sectionTitles": {
    "about": "Over mij",
    "contact": "Contact",
    "home": "Welkom",
    "projects": "Projecten",
    "skills": "Skills"
  },
  "portfolioContent": {
    "projects": {
      "quizzion": {
        "title": "Quizzion 2.0",
        "oneLiner": "Een quiz applicatie voor op school of in het café!",
        "contributions": [
          "Maken van de pagina waarop gebruikers vragen kunnen beantwoorden.",
          "Bijna alle code en stuctuur in de Vuex store.",
          "Koppelen van back- en frontend d.m.v. Vuex actions.",
          "Verbeteren van de structurele samenhang tussen pagina's.",
          "Hosten van de frontend als AWS S3 bucket.",
          "Hosten van de live server en backend op een AWS EC2 instance.",
          "Waarborging van kwaliteit en helpen met bugs oplossen."
        ],
        "description": "Quizzion 2.0 was het laatste project in mijn 2e jaar (mei-juli 2020). De opdracht werd gegeven door een bedrijf in de regio. Het doel was om een quiz applicatie te maken, bovenop een bestaande API voor het opslaan van vragenlijsten.\nIk werd ingedeeld in een groep van 6 studenten, met in totaal 4 verschillende nationaliteiten. Gedurende dit project hadden we geen andere vakken, dus konden we hier fulltime aan werken voor 8 weken. We waren bijna volledig onafhankelijk van het Saxion, en moesten alles zelf regelen, wat ik erg leuk vond.\n\nTijdens de laatste demo, werd ik met mijn groepje door de klant uitgeroepen tot het beste groepje van de in totaal 3 groepjes die deelnamen aan dit project, omdat ze onze applicatie het best vonden."
      },
      "portfolio": {
        "oneLiner": "Leren over design en hoe ik me online kan presenteren!",
        "title": "Mijn Portfolio",
        "description": "Een online portfolio is een goede manier om wat projecten te laten zien in de software wereld. Aangezien ik op zoek ben (nogsteeds!) naar een stageplek, leek het mij een goed idee om er eentje te maken.\nIk had al wat ervaring met websites maken, maar dat was vaak in groepsverband. Het is erg leuk om iets met een groepje te maken, maar je krijgt nooit de kans om alles vanaf het begin helemaal zelf te doen. Dus, ik wilde mezelf uitdagen door geen voorgekauwde template website te maken, maar alles zelf te ontwerpen. Ik had me nog nooit bezig gehouden met mockups of design, omdat dat niet een van mijn sterkste punten is. Natuurlijk, wilde ik wel dat het er een beetje netjes en verzorg uit zag, dus ik begon informatie te zoeken over de essentiële dingen binnen UI/UX design. Na een paar dagen, begon ik met het maken van een ontwerp in Figma.\n\nIk besloot om mijn website te maken met Vue.js, omdat ik daar al relatief veel ervaring mee had, en ik had niet genoeg tijd om iets nieuws te leren naast mijn normale bezigheden."
      },
      "cards": {
        "description": "Begin 2020 begon mijn studievereniging meer tractie te krijgen onder de leden. Het werd een wekelijkse traditie om met z'n allen het weekend in te luiden op donderdag- of vrijdagmiddag.\n\nToen de hogescholen dicht gingen vanwege het Corona virus, stopte die traditie abrupt. Ik begon me te vervelen, en bedacht me een kaartspel wat we vaak speelden als website te programmeren, zodat we het virtueel konden spelen.\n\nIk wist dat ik in het project van het volgende kwartjaar (Quizzion) Vuex zou moeten gebruiken, dus ik besloot om alvast een voorsprong te nemen en alvast wat zou expirimenteren met Vuex. Ik ben erg blij dat ik dat heb gedaan, want het was zeer leerzaam, en heeft me veel geholpen tijdens het Quizzion project.",
        "oneLiner": "Het maken van een online kaartspel voor tijdens de lockdown!",
        "title": "Kaartspel"
      },
      "javalite": {
        "description": "JavaLite is een onderdeel van het vak 'Compilers and Operating Systems'. De opdracht was om mijn eigen programmeertaal te maken, met de daarbijhorende compiler. Hiervoor gebruikte ik ANTLR4 en Jasmin bytecode. In een niet al te creative bui, noemde ik de taal JavaLite omdat het leek op een versimpelde versie van Java.\n\nHet doel van het project was natuurlijk niet om de beste, meest orginele taal te bedenken. We hadden maar 6 weken totdat het moest worden ingeleverd, dus dat was niet haalbaar. De reden voor dit project was om meer inzicht te krijgen in hoe een programmeertaal te werk gaat en waarom dingen zijn zoals ze zijn. De 3 voornaamste componenten van het project zijn:\n1) Definitie van de taal.\n2) Een CodeGenerator die gebaseerd op input, de juiste bytecode produceert.\n3) Een TypeChecker die de CodeGenerator informeert over variabelen, types en scopes.\n\nIk vond dit een erg leuk project, vanwege de complexiteit. Het begin was moeilijk en abstract, maar zodra dingen begonnen te werken werd het steeds leuker!",
        "oneLiner": "Een eigen programmeertaal bedenken en maken in Java!",
        "title": "JavaLite"
      }
    },
    "skillsText": "In de afgelopen paar jaar heb ik al een aantal essentiële vaardigheden opgedaan, zoal het werken met scrum-teams en git. Ik begon met Java leren, voornamelijk object oriented, met een paar vakken over Android of web programmeren (Spring + Thymeleaf). Nadat ik de basis beheerste, heb ik moeilijkere vakken gevolgd. Zoals concurrency, algoritmes en complexiteit. Naast Java heb ik ook back- en frontend web development met Javascript geleerd, met daarbij een paar van de veel voorkomende frameworks.\n\nDit is maar een korte samenvatting van alles wat ik kan, voor een vollediger beeld raad ik je aan om een aantal van mijn projecten te bekijken!",
    "aboutText": "Ik ben Victor Hubbers, een 20-jarige Software Engineering student op Hogeschool Saxion in Deventer. Ik ben nieuwsgierig aangelegd, hou ervan om nieuwe dingen te leren en ik vind zelf dat ik vrij vlot van begrip ben. Naar mijn mening is dit ideaal in de software wereld, omdat ik dingen kan uitproberen en snel kan schakelen.\n\nTijdens mijn opleiding heb ik geleerd om te communiceren met mensen van andere achtergronden. Ik heb namelijk bewust gekozen voor het Saxion omdat zij een internationale stroom Software Engineering aanbieden. Dat houdt in dat al mijn lessen in het engels worden gegeven, en ongerveer 60% van mijn klasgenoten uit het buitenland komt!\nIk heb ook ervaring met multidisciplinaire teams, zo werk ik op dit moment samen met studenten van verpleegkunde en creative business aan een half jaar durend onderzoek."
  },
  "footer": {
    "summerText": "Afkoelen?\nVerander het thema rechts bovenaan je scherm!",
    "winterText": "Opwarmen?\nVerander het thema rechts bovenaan je scherm!"
  },
  "projectOverview": {
    "moreInfoButton": "Meer informatie",
    "viewCodeButton": "Code bekijken",
    "visitButton": "Bezoeken",
    "myContributions": "Mijn bijdrage"
  }
}